[Killed] BlockStatement
development/payment-auth-example-for-stryker/src/Money.js:2:41
 export class Money {
-  constructor(majorAmount, minorAmount) {
-    this.majorAmount = majorAmount;
-    this.minorAmount = minorAmount;
-    this.currency = "EUR";
-  }
+  constructor(majorAmount, minorAmount) {}
   toDecimal() {
     return this.majorAmount * 10 * 10 + this.minorAmount;
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
development/payment-auth-example-for-stryker/src/Money.js:7:15
     this.minorAmount = minorAmount;
     this.currency = "EUR";
   }
-  toDecimal() {
-    return this.majorAmount * 10 * 10 + this.minorAmount;
-  }
+  toDecimal() {}
   compareTo(other) {
     return this.toDecimal() - other.toDecimal();
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArithmeticOperator
development/payment-auth-example-for-stryker/src/Money.js:8:12
     this.currency = "EUR";
   }
   toDecimal() {
-    return this.majorAmount * 10 * 10 + this.minorAmount;
+    return this.majorAmount * 10 * 10 - this.minorAmount;
   }
   compareTo(other) {
killedBy: Money should compute a sane toDecimal
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1034
Received: 966
