[Survived] BlockStatement
development/payment-auth-example-for-stryker/src/PaymentAuth.js:2:17
 export class PaymentAuth {
-  constructor() {
-    this.approvalNeeded = false;
-    this.primaryApprover = null;
-  }
+  constructor() {}
 }
 
