[Killed] BlockStatement
development/payment-auth-example-for-stryker/src/Payment.js:2:34
 export class Payment {
-  constructor(amount, initiator) {
-    this.amount = amount;
-    this.initiator = initiator;
-  }
+  constructor(amount, initiator) {}
 }
 
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read property 'limit' of undefined
