[Killed] BlockStatement
development/payment-auth-example-for-stryker/src/checkFor.js:3:55
 import { PaymentAuth } from "./PaymentAuth";
 
-export const primaryApprover = (initiator, amount) => {
-  let supervisor = initiator.supervisor;
-  let limit = supervisor.limit;
-  const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
-    if (amount.compareTo(limit) > 0) {
-      supervisor = supervisor.supervisor;
-      limit = supervisor.limit;
-    }
-  }
-  return supervisor;
-};
+export const primaryApprover = (initiator, amount) => {};
 
 export const checkFor = (payment) => {
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: TypeError: Cannot read property 'name' of undefined

[Survived] BlockStatement
development/payment-auth-example-for-stryker/src/checkFor.js:7:43
   let supervisor = initiator.supervisor;
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
-    if (amount.compareTo(limit) > 0) {
-      supervisor = supervisor.supervisor;
-      limit = supervisor.limit;
-    }
-  }
+  for (let i = 0; i < maxIterations; i++) {}
   return supervisor;
 };

[Survived] EqualityOperator
development/payment-auth-example-for-stryker/src/checkFor.js:7:19
   let supervisor = initiator.supervisor;
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
+  for (let i = 0; i >= maxIterations; i++) {
     if (amount.compareTo(limit) > 0) {
       supervisor = supervisor.supervisor;

[Killed] BlockStatement
development/payment-auth-example-for-stryker/src/checkFor.js:16:38
   return supervisor;
 };
 
-export const checkFor = (payment) => {
-  const paymentAuth = new PaymentAuth();
-  const initiator = payment.initiator;
-  const amount = payment.amount;
-  const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
-    paymentAuth.approvalNeeded = false;
-  }
-  if (amount.compareTo(limit) > 0) {
-    paymentAuth.approvalNeeded = true;
-    const approver = primaryApprover(initiator, amount);
-    paymentAuth.primaryApprover = approver;
-  }
-  return paymentAuth;
-};
+export const checkFor = (payment) => {};
 
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read property 'approvalNeeded' of undefined

[Survived] BlockStatement
development/payment-auth-example-for-stryker/src/checkFor.js:21:37
   const initiator = payment.initiator;
   const amount = payment.amount;
   const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
-    paymentAuth.approvalNeeded = false;
-  }
+  if (amount.compareTo(limit) <= 0) {}
   if (amount.compareTo(limit) > 0) {
     paymentAuth.approvalNeeded = true;
