[Killed] StringLiteral
js-meetup/payment-auth-example-for-stryker/src/Money.js:5:21
   constructor(majorAmount, minorAmount) {
     this.majorAmount = majorAmount;
     this.minorAmount = minorAmount;
-    this.currency = "EUR";
+    this.currency = "";
   }
   toDecimal() {
killedBy: Money should initialize with currency Euro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "EUR"
Received: ""
