[Survived] EqualityOperator
js-meetup/payment-auth-example-for-stryker/src/checkFor.js:21:7
   const initiator = payment.initiator;
   const amount = payment.amount;
   const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
+  if (amount.compareTo(limit) < 0) {
     paymentAuth.approvalNeeded = false;
   }

[Survived] ConditionalExpression
js-meetup/payment-auth-example-for-stryker/src/checkFor.js:21:7
   const initiator = payment.initiator;
   const amount = payment.amount;
   const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
+  if (true) {
     paymentAuth.approvalNeeded = false;
   }

[Killed] EqualityOperator
js-meetup/payment-auth-example-for-stryker/src/checkFor.js:24:7
   if (amount.compareTo(limit) <= 0) {
     paymentAuth.approvalNeeded = false;
   }
-  if (amount.compareTo(limit) > 0) {
+  if (amount.compareTo(limit) <= 0) {
     paymentAuth.approvalNeeded = true;
     const approver = primaryApprover(initiator, amount);
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read property 'limit' of undefined
